Simplify script and readme just for Azure OpenAI
